Информационная_база/Enums/ТипыТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыТестирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БинарноеДерево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Плоское</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Информационная_база/CommonModules/ТестированиеКлиентСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Анкетирование"
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция НайтиСтрокуВДанныхФормыТаблица(ГдеИскать,Значение,Колонка) Экспорт
	
	Для каждого Строка Из ГдеИскать Цикл
		Если Строка[Колонка] = Значение Тогда
			Возврат ГдеИскать.Индекс(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область БинарноеДерево

// Обрабатывает ответ пользователя на клиенте для бинарного дерева
//
// Параметры:
//  Тест - ДокументСсылка.ТестБинарноеДерево
//  Ответ - Булево
//
&НаКлиенте
Процедура ОбработатьОтветБинарноеДеревоНаКлиенте(Тест, Ответ) Экспорт
	
	// Передаем булево значение напрямую - true(Да)/false(Нет)
	// Конвертация в перечисление будет на сервере
	БазыБинарныеТестыДдеревьяРешений.ОбработатьОтветБинарноеДеревоНаСервере(Тест, Ответ);
	
КонецПроцедуры


// Обновляет интерфейс для бинарного дерева
//
// Параметры:
//  Форма - УправляемаяФорма - форма теста
//
Процедура ОбновитьИнтерфейсБинарноеДерево(Форма) Экспорт
	
	// Скрываем стандартные элементы
	Форма.Элементы.ГруппаОтвет.Видимость = Ложь;
	Форма.Элементы.ПанельВопросов.Видимость = Ложь;
	
	// Показываем элементы бинарного дерева
	Форма.Элементы.ГруппаБинарноеДерево.Видимость = Истина;
	
	// Обновляем текущий вопрос через серверный вызов
	БазыБинарныеТестыДдеревьяРешений.ОбновитьТекущийВопросБинарноеДеревоНаСервере(Форма);
	
КонецПроцедуры


// Проверяет тип тестирования
//
// Параметры:
//  ШаблонТеста - СправочникСсылка.ШаблоныТестов
//
// Возвращаемое значение:
//   Булево - Истина, если это бинарное дерево
//
Функция ЭтоБинарноеДерево(ШаблонТеста) Экспорт
	
	Если Не ЗначениеЗаполнено(ШаблонТеста) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем тип тестирования на сервере
	Возврат БазыБинарныеТестыДдеревьяРешений.ЭтоБинарноеДеревоНаСервере(ШаблонТеста);
	
КонецФункции

// Проверяет тип тестирования для документа
//
// Параметры:
//  ДокументТеста - ДокументСсылка.Тест, ДокументСсылка.ТестБинарноеДерево
//
// Возвращаемое значение:
//   Булево - Истина, если это бинарное дерево
//
Функция ЭтоБинарноеДеревоДляДокумента(ДокументТеста) Экспорт
	
	Если ТипЗнч(ДокументТеста) = Тип("ДокументСсылка.ТестБинарноеДерево") Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Для обычного теста определяем по шаблону
	Если ЗначениеЗаполнено(ДокументТеста.ШаблонТеста) Тогда
		Возврат ЭтоБинарноеДерево(ДокументТеста.ШаблонТеста);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Получает тип тестирования для документа (серверная версия)
//
// Параметры:
//  ДокументТеста - ДокументСсылка.Тест, ДокументСсылка.ТестБинарноеДерево
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ТипыТестирования
//
&НаСервере
Функция ПолучитьТипТестированияДокумента(ДокументТеста) Экспорт
	
	Если ТипЗнч(ДокументТеста) = Тип("ДокументСсылка.ТестБинарноеДерево") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыТестирования.БинарноеДерево");
	КонецЕсли;
	
	// Для обычного теста определяем по шаблону
	Если ЗначениеЗаполнено(ДокументТеста.ШаблонТеста) Тогда
		Возврат ДокументТеста.ШаблонТеста.ТипТестирования;
	КонецЕсли;
	
	// Значение по умолчанию
	Возврат ПредопределенноеЗначение("Перечисление.ТипыТестирования.Плоское");
	
КонецФункции

#КонецОбласти
